#Область ОсновнойМодуль

&НаКлиенте
Процедура Расш_ДублиМарок_ПриОткрытии(Отказ)
	ПодключитьОбработчикОжидания("ДоступностьУТМ", 5, Истина);
КонецПроцедуры

#КонецОбласти

#Область ПроверкаУТМ
&НаКлиенте
Процедура  ДоступностьУТМ ()
	ОбработатьОжидание();
	ПодключитьОбработчикОжидания("ДоступностьУТМ", 10, Истина);
КонецПроцедуры
 
&НаСервере
Процедура ОбработатьОжидание()
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиОбменаЕГАИС.АдресУТМ,
		|	НастройкиОбменаЕГАИС.ПортУТМ,
		|	НастройкиОбменаЕГАИС.Организация
		|ИЗ
		|	РегистрСведений.НастройкиОбменаЕГАИС КАК НастройкиОбменаЕГАИС
		|ГДЕ
		|	(НастройкиОбменаЕГАИС.РабочееМесто = &РабочееМесто
		|			ИЛИ НастройкиОбменаЕГАИС.РабочееМесто = ЗНАЧЕНИЕ(Справочник.РабочиеМеста.ПустаяССылка))";
	
	Запрос.УстановитьПараметр("РабочееМесто", ПараметрыСеанса.РабочееМестоКлиента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ЗаголовокУТМ = "";
	ЕстьОшибки = ЛОЖЬ;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		АдресУТМ = ВыборкаДетальныеЗаписи.АдресУТМ;
		ПортУТМ = ВыборкаДетальныеЗаписи.ПортУТМ;
		HTTPСервисЗапрос=Новый HTTPСоединение(АдресУТМ, ПортУТМ,,,,2);
		ФайлДубльВ=ПолучитьИмяВременногоФайла("xml");
		Попытка
			HTTPСервисЗапрос.Получить(Новый HTTPЗапрос(""),ФайлДубльВ);
			ЗаголовокУТМ = ЗаголовокУТМ + ?(ЗаголовокУТМ="","",Символы.ПС) + ВыборкаДетальныеЗаписи.Организация + " УТМ ок! ";
		Исключение
			//ПоказатьПредупреждение(,"Запустите службы транспорта и обновления (ярлыки на рабочем столе)");
			ЗаголовокУТМ = ЗаголовокУТМ + ?(ЗаголовокУТМ="","",Символы.ПС) + ВыборкаДетальныеЗаписи.Организация + " УТМ ошибка! ";
			ЕстьОшибки = Истина;
		КонецПопытки;

	КонецЦикла;
	Если ЗаголовокУТМ =  "" Тогда
		Элементы.НадписьУТМ.Заголовок = "Для рабочего места адрес УТМ не задан!";
	Иначе
		Если ЕстьОшибки Тогда
			Элементы.НадписьУТМ.ЦветТекста = WebЦвета.Красный;
		Иначе
			Элементы.НадписьУТМ.ЦветТекста = WebЦвета.Зеленый;
		КонецЕсли;
	
		Элементы.НадписьУТМ.Заголовок = ЗаголовокУТМ;
	КонецЕсли;

КонецПроцедуры
#КонецОбласти
