#Область ПроверкаНашаЛиМарка

&НаКлиенте
Функция ПрочитатьФайл()
	ФайлНаДиске = Новый Файл("D:\marks.txt");
	Если ФайлНаДиске.Существует() Тогда
		Файл = Новый ЧтениеТекста("D:\marks.txt");
		ДанныеЗагрузки = Новый Массив;
		стр = 0;
		Строка = Файл.ПрочитатьСтроку();
		Пока Строка <> Неопределено Цикл
			ДанныеЗагрузки.Добавить(Строка);
			Строка = Файл.ПрочитатьСтроку();     		
		КонецЦикла;
		Файл.Закрыть();
	Иначе
		Сообщить("Файл не найден");
	КонецЕсли;
	Возврат ДанныеЗагрузки;
	
	//сообщить("Ищем " + Данные + " в массиве");
	//Ответ = АнализМарок(ДанныеЗагрузки, Данные);
	//Сообщить("Нашли " + Ответ);
	//Возврат Ответ;
	
КонецФункции

&НаСервере
Функция АнализМарок(ДанныеЗагрузки, Данные)
	i = ДанныеЗагрузки.Найти(Данные);
	Если i <> Неопределено Тогда
	    Сообщить("Значение найдено " + ДанныеЗагрузки[i]);
		Возврат ДанныеЗагрузки[i];
	КонецЕсли;
КонецФункции


&НаКлиенте
Процедура Команда1(Команда)
	Данные = "!root";
	Марки = ПрочитатьФайл();
	Марка = АнализМарок(Марки,Данные);
	
	Если Марка <> Неопределено Тогда
		Сообщить("Все ок " + Марка);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтрШаблон(НСтр("ru = 'Данная марка %1 не является Акцизной Маркой принадлежащей нашей компании! Обратитесь к системному Администратору'"), Марка));
		Возврат;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти